var messages = function(){/*
23:00:00$端傳媒台灣大選即時播報到此結束，感謝讀者收看。
22:50:00$根據中選會公布，蔡英文總得票數為689萬4744票，得票率為56.1234%；朱立倫為381萬3365票，得票率為31.0409%；宋楚瑜為157萬6861票，得票率為12.8357%。
22:30:00$根據中選會預估，本次選舉的投票率僅有66%，創下台灣史上總統直選後，總統大選最低的投票率。
22:20:00$立委選舉結果大致出爐，預估民進黨在113席次中，拿下68席單獨過半（50席區域及18席不分區），首度成為國會最大黨且達成「完全執政」目標；國民黨席次僅35席（24席區域及11席不分區）；時代力量5席（3席區域及2席不分區）；親民黨以不分區拿下3席。以上4個政黨可組黨團。無黨團結聯盟、無黨籍各1席。
22:15:00$根據中選會統計，蔡英文總得票數，確定超過馬英九2012年的689萬1139票。
21:45:00$區域立委選情：逆轉！根據較新的統計結果，桃園市第4選區，國民黨楊麗環以86,220 票對上民進黨鄭寶清86,389票。鄭寶清以169票險勝。最終結果仍要以中選會公布為主。
21:30:00$蔡英文走出黨部與支持者發表感言。現場高喊「總統好」。
21:25:00$遭國民黨撤換總統參選人資格的洪秀柱，晚間在臉書表示，希望蔡英文能夠好好信守承諾，遵守國家憲法，維持兩岸和平，好好照顧這個國家以及人民！她也告訴國民黨支持者，「選舉的失敗，不會使我們分散，反而讓我們更緊密，更加知恥知病 重新奮起！」 
21:20:00$總統府發言人陳以信表示，馬英九總統已經致電恭賀蔡英文。
21:10:00$區域立委選情：桃園市第4選舉區國民黨立委候選人楊麗環在晚間8時自行宣布當選，但根據目前計票結果，她只贏對手鄭寶清30票。依照現行法律，鄭寶清可以聲請重新驗票。
21:00:00$宋楚瑜正在發表敗選感言，並祝賀蔡英文當選。
20:55:00$區域立委選情：新北市第3選區，民進黨高志鵬自行宣布當選。擊敗國民黨李乾龍。
20:45:00$區域立委選情：台北市第6選區，國民黨蔣乃辛自行宣布當選。
20:40:00$區域立委選情：桃園市第6選區，無黨籍趙正宇自行宣布當選。擊敗國民黨孫大千。
20:38:00$區域立委選情：台北市第8選區（文山、中正），國民黨賴士葆自行宣布當選。擊敗無黨籍李慶元。
20:35:00$區域立委選情：新竹縣選區，國民黨林為洲自行宣布當選。
20:30:00$蔡英文正在舉行國際記者會。
20:25:00$區域立委選情：林昶佐在開完記者會後，站上宣傳車與台下近千名支持者喊：「誰說318的學生不能進去國會？誰說各行各業的人不能進入國會？」他說，要在這4年改革國會過去10幾年的問題；進入國會將處理不當黨產取得條例、公民投票法、罷免法。他也說，這是第一次亞洲搖滾歌手進入國會，這也是百年來第一次進步力量過半。
20:22:00$區域立委選情：台北市第2選區，民進黨姚文智自行宣布當選。
20:20:00$宋楚瑜晚間9時將發表敗選感言。
20:17:00$區域立委選情：台北市第4選區，國民黨李彥秀自行宣布當選。擊敗親民黨黃珊珊。
20:15:00$區域立委選情：桃園市第3選區（中壢），國民黨陳學聖自行宣布當選。
20:10:00$總統大選目前開出1077萬票，蔡英文以603萬票領先朱立倫的334萬票。而宋楚瑜得票率約13%，獲得接近140萬票。
20:05:00$區域立委選情：民進黨資深立委柯建銘自行宣布當選新竹市立委，成功擺脫時代力量邱顯智及國民黨競爭者鄭正鈐。
20:03:00$區域立委選情：新北市第1選區，民進黨呂孫綾自行宣布當選。擊敗國民黨吳育昇。
20:02:00$區域立委選情：新北市第8選選區，民進黨江永昌自行宣布當選。擊敗國民黨張慶忠。
20:00:00$區域立委選情：國民黨林郁方宣布敗選，時代力量林昶佐即將到場召開勝選記者會，林妻Doris剛受訪表示，未來將繼續替人民服務。
19:56:00$區域立委選情：高雄市第3選區，民進黨劉世芳自行宣布當選。
19:54:00$區域立委選情：新北市12選區，時代力量黃國昌打敗國民黨李慶華，自行宣布當選。
19:52:00$區域立委選情：台北市第5選區，國民黨林郁方自行宣布敗選。該選區由時代力量林昶佐勝出。
19:50:00$區域立委選情：彰化縣第3選區，民進黨洪宗熠自行宣布當選。
19:49:00$區域立委選情：新北市第4選區，民進黨吳秉叡自行宣布當選。
19:47:00$區域立委選情：新北市第9選區，國民黨林德福自行宣布當選。
19:46:00$區域立委選情：台北市第1選區，民進黨吳思瑤自行宣布當選，打敗國民黨丁守中。
19:44:00$目前全國不分區立委的政黨票，民進黨44%；國民黨27%；親民黨6.5%；時代力量5.9%。其他有望跨過5%門檻的還有新黨和台聯基進側翼。
19:41:00$行政院長毛治國已向總統馬英九請辭，不接受慰留，並將依循憲政慣例，在最短時間內率內閣完成總辭。 
19:38:00$區域立委選情：目前僅剩下6縣市未開完，雲林以南、宜蘭、花蓮、台東均由民進黨勝選。
19:34:00$區域立委選情：在73席區域立委當中，已經有50席得出結果，其中民進黨38席，國民黨11席，時代力量1席。
19:32:00$區域立委選情：台北市第3選區，蔣經國的孫子蔣萬安自行宣布當選，也是台北市第一位自行宣布當選立委。
19:31:00$區域立委選情：台中市第3選區，時代力量洪慈庸自行宣布當選；同時是時代力量當選第一人。
19:29:00$區域立委選情：新北市第7選區，民進黨羅致政自行宣布當選。
19:27:00$區域立委選情：嘉義市選區，民進黨李俊俋自行宣布當選。
19:26:00$區域立委選情：在基隆參選的國民黨副主席郝龍斌敗選，同時宣布辭去黨副主席。
19:25:00$區域立委選情：彰化縣第2選區，民進黨黃秀芳自行宣布當選。
19:21:00$區域立委選情：雲林縣第2選區，民進黨劉建國自行宣布當選。
19:20:00$區域立委選情：高雄市第8選區，民進黨許智傑自行宣布當選。
19:19:00$區域立委選情：台中市第8選區，國民黨江啟臣自行宣布當選。
19:17:00$區域立委選情：屏東縣第3選區，民進黨莊瑞雄自行宣布當選。
19:15:00$區域立委選情：新北市第7選區，國民黨江惠貞自行宣布敗選。
19:13:00$區域立委選情：台中市第7選區，民進黨何欣純自行宣布當選。
19:11:00$區域立委選情：高雄市第6選區，民進黨李昆澤自行宣布當選。
19:10:00$現場：朱立倫7點整偕夫人高婉倩步出黨部，一言不發的走上台後深深一鞠躬。隨後宣布辭黨主席以示負責，並強調國民黨將在谷底扎根，深切反省。
19:09:00$區域立委選情：屏東縣第1選區，民進黨蘇震清自行宣布當選。
19:07:00$區域立委選情：高雄市第9選區，民進黨賴瑞隆自行宣布當選。 
19:05:00$區域立委選情：屏東縣第2選區，民進黨鍾佳濱自行宣布當選，擊敗國民黨王進士。
19:02:00$區域立委選情：新北市第5選區，民進黨蘇巧慧自行宣布當選。
19:01:00$朱立倫正在黨中央發表談話，承認敗選，向選民致歉，宣布辭去黨主席；並祝福蔡英文與民進黨，稱台灣選民是最大贏家。
19:00:00$時代力量黃國昌競選總部在辦公室後面的停車場臨時搭建了開票會場，場內擠滿了支持者，現場以中高齡選民為主。主持人操著一口流利的台語宣布黃國昌目前領先對手李慶華7000票，現場歡聲雷動。
18:59:00$區域立委選情：時代力量林昶佐競辦前聚集近200人至馬路大喊「凍算！」傳來領先2000票，集體揮旗歡呼，亦有民眾開啤酒慶祝領先。
18:58:00$區域立委選情：花蓮縣選區，民進黨蕭美琴自行宣布當選。
18:57:00$區域立委選情：高雄市第4選區，民進黨林岱樺自行宣布當選。
18:56:00$區域立委選情：高雄市第7選區，民進黨趙天麟自行宣布當選。
18:55:00$區域立委選情：台南市第4選區，民進黨林俊憲自行宣布當選。
18:53:00$區域立委選情：彰化縣第4選區，民進黨陳素月自行宣布當選。
18:52:00$區域立委選情：高雄市第2選區，民進黨邱志偉自行宣布當選。
18:51:00$區域立委選情：台中市第3選區，國民黨楊瓊瓔自行宣布敗選，時代力量洪慈庸勝出。
18:50:00$區域立委選情：雲林縣第1選區，民進黨蘇治芬自行宣布當選。
18:49:00$區域立委選情：宜蘭縣選區，民進黨陳歐珀自行宣布當選。
18:48:00$區域立委選情：高雄市第1選區，民進黨邱議瑩自行宣布當選。
18:47:00$區域立委選情：台東縣選區，民進黨劉櫂豪自行宣布當選。
18:46:00$區域立委選情：雲林縣第1選區，國民黨張鎔麒自行宣布敗選。
18:45:00$區域立委選情：南投縣第1選區，國民黨馬文君自行宣布當選。
18:44:00$區域立委選情：嘉義縣第2選區，民進黨陳明文自行宣布當選。
18:43:00$區域立委選情：彰化縣第1選區，國民黨王惠美自行宣布當選。
18:42:00$區域立委選情：嘉義縣第1選區，民進黨蔡易餘自行宣布當選。
18:41:00$區域立委選情：桃園市第1選區，民進黨鄭運鵬自行宣布當選，擊敗國民黨陳根德。
18:40:00$區域立委選情：苗栗縣第2選區，國民黨徐志榮自行宣布當選。
18:37:00$區域立委選情：台中市第5選區，國民黨盧秀燕自行宣布當選。
18:35:00$區域立委選情：新北市第10選區（土城、三峽），民進黨吳琪銘自行宣布當選。
18:33:00$區域立委選情：桃園市第2選區，民進黨陳賴素美自行宣布當選。
18:31:00$區域立委選情：台南市第1選區，民進黨葉宜津自行宣布當選。
18:29:00$區域立委選情：高雄市第5選區，民進黨管碧玲自行宣布當選。
18:27:00$區域立委選情：屏東縣第2選區，國民黨王進士自行宣布敗選。
18:25:00$區域立委選情：苗栗縣第1選區，國民黨陳超明自行宣布當選。 
18:22:00$區域立委選情：南投縣第2選區，國民黨許淑華自行宣布當選。
18:20:00$區域立委選情：台中市第1選區，民進黨蔡其昌自行宣布當選。
18:18:00$區域立委選情：台中市第6選舉，民進黨黃國書自行宣布當選。
18:17:00$區域立委選情：台中市第4選區，民進黨張廖萬堅自行宣布當選。
18:16:00$區域立委選情：台中市應選8席，目前國民黨3席，民進黨4席，另一席暫時領先的為時代力量洪慈庸。
18:15:00$區域立委選情：基隆選區、國民黨副主席郝龍斌宣布敗選，民進黨黨部支持者歡呼。
18:13:00$區域立委選情：台中市第2選區，國民黨顏寬桓宣布當選。
18:10:00$區域立委選情：台南市第3選區，民進黨陳亭妃自行宣布當選。
18:06:00$區域立委選情：台南市第5選區，民進黨王定宇自行宣布當選。
18:01:00$區域立委選情：金門縣選區，國民黨楊鎮浯自行宣布當選。
17:58:00$區域立委選情：南投縣第2選區，民進黨蔡煌瑯自行宣布敗選。
17:55:00$區域立委選情：澎湖縣選區，民進黨楊曜自行宣布當選。
17:52:00$區域立委選情：桃園市應選6席，目前國民黨3席，民進黨3席，但國民黨在2個選區僅以些微差距領先。
17:50:00$區域立委選情：新北市應選12席，目前國民黨2席，民進黨9席，時代力量1席，但民進黨在2個選區僅以些微差距領先。
17:49:00$區域立委選情：台南市第2選舉區民進黨黃偉哲自行宣布當選。
17:48:00$蔡英文總部現場歡呼，即將迎來500萬票。
17:45:00$國民黨開票情況不佳，國民黨發言人楊偉中宣布辭職。
17:41:00$區域立委選情：連江縣選區，國民黨陳雪生自行宣布當選。
17:39:00$區域立委選情：台北市應選8席，目前國民黨6席，民進黨2席，但國民黨在3個選區僅以些微差距領先。
17:38:00$國民黨部外頭的晚會，大約僅幾百名群眾，其中不少人揮舞著國旗，台上先後演唱了「熱情的沙漠」和「寶島曼波」。
17:36:00$總統票開出破1000萬。
17:34:00$區域立委選情：國民黨蔣萬安領先綠社盟李晏榕。
17:30:00$開票1個半小時，總統票已開出超過877萬票。蔡英文領先朱立倫200萬票。
17:25:00$區域立委選情：台南市第二選區民進黨籍候選人葉宜津即將自行宣布當選。
17:23:00$立委激戰選區速報：國民黨副主席郝龍斌在基隆暫時落後民進黨蔡適應。
17:22:00$立委激戰選區速報：國民黨李慶華領先時代力量黃國昌。
17:20:00$蔡英文陣營宣布，目前蔡英文拿54%；朱立倫拿28%。蔡有機會突破700萬票。
17:17:00$區域立委選情：截至目前為止，民進黨在雲林以南全面領先，國民黨席次為0。
17:15:00$開票1小時，總統票已開出超過500萬票。蔡英文遙遙領先。
17:11:00$立委激戰選區速報：時代力量洪慈庸、黃國昌暫時領先對手。
17:08:00$蔡英文抵達競選總部，現場響起「總統好！」的歡呼。
17:05:00$立委激戰選區速報：民進黨呂孫綾領先國民黨吳育昇。
17:00:00$立委激選區戰速報：國民黨林郁方領先時代力量林昶佐。
16:55:00$民進黨總部前的華山公園，已經聚集數千名支持者，為剛破百萬的得票數高聲歡呼，在饒舌歌手的音樂中信心迎接勝選。
16:30:00$開票半小時，蔡英文得票穩定領先朱立倫、宋楚瑜。
16:00:00$投票截止，台灣進入開票時間。
15:59:00$距離台灣第14任總統副總統及第9屆立法委員投票結束還剩1分鐘，請跟端傳媒一起倒數……
23:45:00$端傳媒自16日下午4時半起，將即時更新台灣總統大選暨立委選舉情況，敬請期待。


*/}.toString().slice(14, -3)

messagesHandler(function(msgs) {
  var msgItems = []
  var msgsList = msgs.trim().split('\n')
  for(var i in msgsList) {
    var m = msgsList[i].trim()
    var item = m.split('$')

    msgItems.push({
      type: 'smallItem',
      label: item[0],
      shortContent: item[1],
      forcePosition: 'right'
    })
  }
  return msgItems  
}(messages))
